tut_learning/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( 
  volVectorFieldValue U (0 0 0) 
  volScalarFieldValue T 348.432 
  volScalarFieldValue p 100000 
);

regions         
( 
  boxToCell 
  { 
    box (0 -1 -1) (5 1 1) ; 

    fieldValues 
      ( 
        volScalarFieldValue T 278.746 
        volScalarFieldValue p 10000 
      ); 
  } 
);


// ************************************************************************* //
